Name: Godfrey

In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns
sns.set_theme(style = 'darkgrid')

Creating a function to merge all the .txt files into one panda data frame

In [2]:
# read the content of the first file
column_heads = ['name', 'gender', 'counts']
ba80 =pd.read_csv('c:/python/names/yob1880.txt',encoding = "ISO-8859-1", header = None, names = column_heads)
ba80['yob'] = 1880
ba80.head()

        name gender  counts   yob
0       Mary      F    7065  1880
1       Anna      F    2604  1880
2       Emma      F    2003  1880
3  Elizabeth      F    1939  1880
4     Minnie      F    1746  1880

In [3]:
#function to read and combine all txt files. It returns one data frame and all the rows which were read.

def read_all_files(baby):
    column_heads = ['name', 'gender', 'counts']
    total_rows = len(baby.index)
    for year in range(1881,2019):
        path = 'c://python//names//yob' + str(year) + '.txt'
        bab = pd.read_csv(path,encoding = "ISO-8859-1", header = None, names = column_heads)
        bab['yob'] = year
        total_rows += len(bab.index)
        baby = baby.append(bab,ignore_index=False)
    return baby,total_rows

In [5]:
#check if total number of rows from each files equals to the total number of rows in a panda data frame
baby_dt, rows = read_all_files(ba80)
print(rows)
print(len(baby_dt.index))

1957046
1957046

In [6]:
rows == len(baby_dt.index)

True

1)     What were the most popular  girl’s and boy’s names in the last decade (2009-2018)? Can you notice any trends in names?

In [7]:
baby_dt.head()

        name gender  counts   yob
0       Mary      F    7065  1880
1       Anna      F    2604  1880
2       Emma      F    2003  1880
3  Elizabeth      F    1939  1880
4     Minnie      F    1746  1880

In [8]:
baby_dt.isnull().any()

name      False
gender    False
counts    False
yob       False
dtype: bool

In [9]:
baby_dt.describe()

             counts           yob
count  1.957046e+06  1.957046e+06
mean   1.796856e+02  1.975563e+03
std    1.522804e+03  3.419121e+01
min    5.000000e+00  1.880000e+03
25%    7.000000e+00  1.952000e+03
50%    1.200000e+01  1.985000e+03
75%    3.200000e+01  2.004000e+03
max    9.968900e+04  2.018000e+03

All names sorted in descending order for the decade (2009-2018)

In [21]:
all_names = baby_dt.query("2009<=yob<=2018").groupby(['name','gender']).sum().sort_values(by='counts',ascending = False)
all_names.reset_index(inplace=True)
all_names = all_names.drop('yob', axis=1)
all_names.head()

       name gender  counts
0      Emma      F  195305
1    Sophia      F  183930
2    Olivia      F  183016
3      Noah      M  180904
4  Isabella      F  179015

a) overall most popular 10 names  for boys for the entire decade

In [26]:
all_names.query("gender == 'M'")[:10]

         name gender  counts
3        Noah      M  180904
5       Jacob      M  173195
6     William      M  163811
7        Liam      M  161558
8       Ethan      M  157359
10      Mason      M  156764
11    Michael      M  152983
12  Alexander      M  148711
13     Daniel      M  140504
14      James      M  140268

b) Overall most popular 10 names for girls for the entire decade

In [27]:
all_names.query("gender == 'F'")[:10]

         name gender  counts
0        Emma      F  195305
1      Sophia      F  183930
2      Olivia      F  183016
4    Isabella      F  179015
9         Ava      F  156852
21        Mia      F  127727
22      Emily      F  124501
23    Abigail      F  123643
34    Madison      F  107153
38  Elizabeth      F   96867